src/cf/src/Documents/УстановкаЦенНоменклатуры/УстановкаЦенНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаЦенНоменклатуры</name>
  <basedOn>Document.ПоступлениеТоваровУслуг</basedOn>
  <registerRecords>InformationRegister.ЦеныНоменклатуры</registerRecords>
  <attributes>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяГруппа</name>
    <type>
      <types>CatalogRef.ТоварныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧЦены</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаЗакупочная</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаРозничная</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Documents/УстановкаЦенНоменклатуры/ManagerModule.bsl
Процедура Печать(Таб, Док, Параметры) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Таб.ОтображатьСетку = Ложь;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ОтображатьГруппировки = Истина;
	Таб.АвтоМасштаб = Истина;
	// Получаем макет
	Макет = Документы.УстановкаЦенНоменклатуры.ПолучитьМакет("Прайс");
	оЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	оГруппа = Макет.ПолучитьОбласть("Группа|Основная");
	оГруппаНДС = Макет.ПолучитьОбласть("Группа|НДС");
	оСтрока = Макет.ПолучитьОбласть("Строка|Основная");
	оСтрокаНДС = Макет.ПолучитьОбласть("Строка|НДС");
	// Выводим заголовок
	Ответственный = Док.Ответственный;
	оЗаголовок.Параметры.ТоварнаяГруппа = Док.ТоварнаяГруппа;	
	оЗаголовок.Параметры.ДатаПрайса = Формат(Док.Дата, "ДЛФ=DD");
	Таб.Вывести(оЗаголовок);
	// Получаем данные
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ТЧЦены.Номенклатура.ЭтоГруппа КАК ЭтоГруппа,
	               |	ТЧЦены.Номенклатура КАК Товар,
	               |	ТЧЦены.Номенклатура.Единица КАК Единица,
	               |	ТЧЦены.Номенклатура.СтавкаНДС КАК СтавкаНДС,
	               |	ТЧЦены.Цена КАК Цена
	               |ИЗ
	               |	Документ.УстановкаЦенНоменклатуры.ТЧЦены КАК ТЧЦены
	               |ГДЕ
	               |	ТЧЦены.Ссылка = &Док
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЭтоГруппа УБЫВ,
	               |	ТЧЦены.Номенклатура.Наименование";
	Если Параметры.ВывестиИерархию Тогда
		ТекстЗапроса = ТекстЗапроса + "
                   |ИТОГИ
                   |	МАКСИМУМ(Единица),
                   |	МАКСИМУМ(Цена)
                   |ПО
                   |	Товар ИЕРАРХИЯ"	
	КонецЕсли;	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.Параметры.Вставить("Док", Док);		
	Запрос.Параметры.Вставить("НаДату", Док.Дата);		
	Таб.Вывести(Макет.ПолучитьОбласть("Шапка|Основная"));
	Если Параметры.ВывестиНДС Тогда
		Таб.Присоединить(Макет.ПолучитьОбласть("Шапка|НДС"));	
	КонецЕсли;
	Ном = 1; 
	Если Параметры.ВывестиИерархию Тогда
		Таб.НачатьАвтогруппировкуСтрок();
		Выб = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока Выб.Следующий() Цикл
			Если Выб.ЭтоГруппа Тогда			
				оГруппа.Параметры.Заполнить(Выб);
				Отступ = "";
				Для А = 1 По Выб.Уровень() Цикл
					Отступ = Отступ + Символы.Таб;	
				КонецЦикла;
				оГруппа.Параметры.Товар = Отступ + Выб.Товар;
				Таб.Вывести(оГруппа, Выб.Уровень(),, Истина);
				Если Параметры.ВывестиНДС Тогда
					Таб.Присоединить(оГруппаНДС);	
				КонецЕсли;
			Иначе
				оСтрока.Параметры.Заполнить(Выб);
				оСтрока.Параметры.Ном = Ном;
				Таб.Вывести(оСтрока, Выб.Уровень(),, Истина);
				Если Параметры.ВывестиНДС Тогда
					оСтрокаНДС.Параметры.СтавкаНДС = Выб.СтавкаНДС;
					оСтрокаНДС.Параметры.НДС = РаботаСДокументамиКлиентСервер.РассчитатьСуммуНДС(Выб.СтавкаНДС, Выб.Цена);
					Таб.Присоединить(оСтрокаНДС);	
				КонецЕсли;
				Ном = Ном + 1;
			КонецЕсли;
		КонецЦикла;
		Таб.ЗакончитьАвтогруппировкуСтрок();
	Иначе
		Выб = Запрос.Выполнить().Выбрать();
		Пока Выб.Следующий() Цикл
			оСтрока.Параметры.Заполнить(Выб);
			оСтрока.Параметры.Ном = Ном;
			Таб.Вывести(оСтрока);
			Если Параметры.ВывестиНДС Тогда
				оСтрокаНДС.Параметры.СтавкаНДС = Выб.СтавкаНДС;
				оСтрокаНДС.Параметры.НДС = РаботаСДокументамиКлиентСервер.РассчитатьСуммуНДС(Выб.СтавкаНДС, Выб.Цена);
				Таб.Присоединить(оСтрокаНДС);	
			КонецЕсли; 
			Ном = Ном + 1;
		КонецЦикла;
	КонецЕсли;
	Таб.ВывестиГоризонтальныйРазделительСтраниц();
КонецПроцедуры
